// Переменная i имеет тип int и содержит число 493. 
// Что будет напечатано в результате следующего вызова printf?
// printf("%d:%6d:%-6d:%06d:%7.5d:%x:%X\n", i, i, i, i, i, i, i);
////////////////////////////////////////////////////////////////
#include <stdio.h>


int main() {
    int i = 493;
    printf("%d:%6d:%-6d:%06d:%7.5d:%x:%X\n", i, i, i, i, i, i, i);

    return 0;
}
////////////////////////////////////////////////////////////////
// '-' это обозначение пробела
// 493:---493:493---:000493:--00493:1ed:1ED
