// Напишите функцию которая получает на вход адрес начала текстовой строки и
// возвращает в качестве значения количество пробелов в этой строке
//
// *Пусть читает из файла а не просто из строчки
////////////////////////////////////////////////////////////////
#include <stdio.h>
#include <stdlib.h>

int main() {
    int a = 0;
    char ch;
    FILE *file;
    file = fopen("input.txt", "r");

    if (file == NULL) {
        perror("!!!");
        return EXIT_FAILURE;
    }
    
    while ((ch = fgetc(file)) != EOF) {
        if (ch == ' ') {
            a++;
        }
    }

    printf("%d", a);

    return 0;
}
////////////////////////////////////////////////////////////////
//
//
