// Чему равны следующий выражения? Ответ запишите в десятичной системе.
// a) '2' + 3 = %d
// b) 3 + 'a'
// c) 'Z' - 'X'
// d) ' ' * 10
// e) '\n' * 4
// f) 17 / 5
// g) 17 % 5
// h) 17 / 15
// i) !25
// j) !0
// k) 23 >> 3
// l) 15 << 3
// m) ~35
// n) ~(-47)
// o) 21 ^ 15
// p) 21 && 10
// q) 21 & 10
// r) 21 || 7
// s) 21 | 7
// t) 252 & ~15
////////////////////////////////////////////////////////////////
#include <stdio.h>


int main() {
    int a = '2' + 3;
    int b = 3 + 'a';
    int c = 'Z' - 'X';
    int d = ' ' * 10;
    int e = '\n' * 4;
    int f = 17 / 5;
    int g = 17 % 5;
    int h = 17 / 15;
    int i = !25;
    int j = !0;
    int k = 23 >> 3;
    int l = 15 << 3;
    int m = ~35;
    int n = ~(-47);
    int o = 21 ^ 15;
    int p = 21 && 10;
    int q = 21 & 10;
    int r = 21 || 7;
    int s = 21 | 7;
    int t = 252 & ~15;

    printf("a) '2' + 3 = %d\n", a);
    printf("b) 3 + 'a' = %d\n", b);
    printf("c) 'Z' - 'X' = %d\n", c);
    printf("d) ' ' * 10 = %d\n", d);
    printf("e) '\n' * 4 = %d\n", e);
    printf("f) 17 / 5 = %d\n", f);
    printf("g) 17 % 5 = %d\n", g);
    printf("h) 17 / 15 = %d\n", h);
    printf("i) !25 = %d\n", i);
    printf("j) !0 = %d\n", j);
    printf("k) 23 >> 3 = %d\n", k);
    printf("l) 15 << 3 = %d\n", l);
    printf("m) ~35 = %d\n", m);
    printf("n) ~(-47) = %d\n", n);
    printf("o) 21 ^ 15 = %d\n", o);
    printf("p) 21 && 10 = %d\n", p);
    printf("q) 21 & 10 = %d\n", q);
    printf("r) 21 || 7 = %d\n", r);
    printf("s) 21 |7 = %d\n", s);
    printf("t) 252 & ~15 = %d\n", t);

    return 0;
}
////////////////////////////////////////////////////////////////
// a) '2' + 3 = 53
// b) 3 + 'a' = 100
// c) 'Z' - 'X' = 2
// d) ' ' * 10 = 320
// e) '
// ' * 4 = 40
// f) 17 / 5 = 3
// g) 17  = 2
// h) 17 / 15 = 1
// i) !25 = 0
// j) !0 = 1
// k) 23 >> 3 = 2
// l) 15 << 3 = 120
// m) ~35 = -36
// n) ~(-47) = 46
// o) 21 ^ 15 = 26
// p) 21 && 10 = 1
// q) 21 & 10 = 0
// r) 21 || 7 = 1
// s) 21 |7 = 23
// t) 252 & ~15 = 240
//
